app/controllers/rides_controller.rb

INSERT INTO "rides" ("owner_id", "origin", "destination", "departure_at", "capacity", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @ride = current_user.rides.new(ride_params)

    respond_to do |format|
      if @ride.save

UPDATE "rides" SET "capacity" = $1, "updated_at" = $2 WHERE "rides"."id" = $3  [["capacity", 2], ["updated_at", "2018-11-29 00:08:34.214454"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @ride.update(ride_params)

DELETE FROM "rides" WHERE "rides"."id" = $1  [["id", 1]]
---
  def destroy
    @ride.destroy