app/controllers/rides_controller.rb

  def index
    @rides = Ride.all
---
SELECT "rides".* FROM "rides"