app/views/rides/index.html.erb

SELECT "rides".* FROM "rides"
---
<% content_for(:page_title) do %>
  <%= Ride.model_name.human(count: @rides.count) %>

SELECT "rides".* FROM "rides"
---

<h1><%= @rides.count%> <%= Ride.model_name.human(count: @rides.count) %></h1>